company_list = [
    '삼성전자',               # 삼성
    'SK하이닉스',            # SK
    '삼성바이오로직스',       # 삼성
    'LG에너지솔루션',         # LG
    '삼성전자우',            # 삼성
    'KB금융',                # 기타 (금융)
    '한화에어로스페이스',      # 한화
    '현대차',                # 현대
    '두산에너빌리티',         # 두산
    '셀트리온',              # 기타 (바이오)
    '기아',                 # 현대
    'NAVER',               # 네이버
    'HD현대중공업',          # 현대
    '신한지주',              # 기타 (금융)
    '삼성물산',              # 삼성
    '현대모비스',            # 현대
    '삼성생명',              # 삼성
    '알테오젠',              # 기타 (바이오)
    '하나금융지주',           # 기타 (금융)
    'HMM',                 # 기타 (해운)
    '카카오',               # 카카오
    'POSCO홀딩스',           # 기타 (포스코)
    '한화오션',              # 한화
    'HD한국조선해양',         # 현대
    '한국전력',              # 기타 (공기업)
    '삼성화재',              # 삼성
    '현대로템',              # 현대
    'SK스퀘어',              # SK
    '메리츠금융지주',         # 기타 (금융)
    'LG화학',               # LG
    '우리금융지주',           # 기타 (금융)
    'KT&G',               # 기타 (담배)
    'HD현대일렉트릭',        # 현대
    'SK이노베이션',          # SK
    '기업은행',              # 기타 (금융/공기업)
    '크래프톤',              # 기타 (게임)
    '고려아연',              # 기타 (소재)
    '삼성중공업',            # 삼성
    'SK',                  # SK
    '삼성에스디에스',         # 삼성
    'KT',                  # 기타 (통신)
    '삼성SDI',              # 삼성
    '카카오뱅크',            # 카카오
    'LIG넥스원',             # 기타 (방산)
    'LG',                  # LG
    'LG전자',               # LG
    'SK텔레콤',             # SK
    '미래에셋증권',           # 기타 (금융)
    '하이브',                # 기타 (엔터)
    '삼양식품'               # 기타 (식품)
]